## Estadística Aplicada
Sección 3 - 17 agosto 2023

Francisco Humberto Villegas Reyna 1731722

Grupo 43

# Tuplas
Es una coleccion de objetos que es inmutables(no se pueden cambiar)

In [1]:
#tuplas

tupla_alumno=('Juan', 'Diaz', 22)

In [2]:
type(tupla_alumno)

tuple

In [3]:
tupla_alumno.remove('Juan')

AttributeError: 'tuple' object has no attribute 'remove'

# Diccionarios
clave - valor

In [4]:
d_alumno1={'Nombre':'Paco','Apellido':'Villegas'}

In [5]:
type(d_alumno1)

dict

In [7]:
grupo_metodosE={'Nombre':['Ale','Ana','Alba'],'Edad':[22,23,24]}

In [10]:
grupo_metodosE['Edad']

[22, 23, 24]

In [11]:
grupo_metodosE.values()

dict_values([['Ale', 'Ana', 'Alba'], [22, 23, 24]])

## Pandas
Pandas esta construido sobre numpy por tanto todas las funciones de numpy se pueden usar en Pandas.
Pandas sirve para manejar datos estrucuturados , los cuales son de tres tipos:

1.- las series(unidimensionales)
2 . los dataframes(filas y columnas)
3.- Panel(datos filas y columas atraves del tiempo )

In [12]:
import pandas as pd

Supongamos que conocemos las edades de :Juan 23, Jorge 18, Raúl 15 , Omar 31

In [13]:
edades=[23,18,15,31]

In [14]:
edades

[23, 18, 15, 31]

In [16]:
edades=pd.Series(edades,index=['Juan', 'Jorge','Raúl', 'Omar'])

In [17]:
edades

Juan     23
Jorge    18
Raúl     15
Omar     31
dtype: int64

## DataFrames
datos organizados en filas y columnas

In [18]:
alumno1=['Jorge','Perez',21]
alumno2=['Ana','Rosa',26]
alumno3=['Raúl','Gomez',22]
alumno4=['Andrea','Solis',19]

In [19]:
clase_estadistica=[alumno1,alumno2,alumno3,alumno4]

In [20]:
clase_estadistica

[['Jorge', 'Perez', 21],
 ['Ana', 'Rosa', 26],
 ['Raúl', 'Gomez', 22],
 ['Andrea', 'Solis', 19]]

In [23]:
#convertirlo en una dataframe 
clase_estadistica=pd.DataFrame(clase_estadistica, columns=)

In [24]:
clase_estadistica

   Nombre Apellido  Edad
0   Jorge    Perez    21
1     Ana     Rosa    26
2    Raúl    Gomez    22
3  Andrea    Solis    19

In [25]:
clase_estadistica.index

RangeIndex(start=0, stop=4, step=1)

In [26]:
clase_estadistica.columns

Index(['Nombre', 'Apellido', 'Edad'], dtype='object')

In [27]:
clase_estadistica.shape

(4, 3)

In [28]:
clase_estadistica

   Nombre Apellido  Edad
0   Jorge    Perez    21
1     Ana     Rosa    26
2    Raúl    Gomez    22
3  Andrea    Solis    19

In [29]:
clase_estadistica['municipio']=['Monterrey','Apodaca','Escobedo','Santiago']

In [30]:
clase_estadistica

   Nombre Apellido  Edad  municipio
0   Jorge    Perez    21  Monterrey
1     Ana     Rosa    26    Apodaca
2    Raúl    Gomez    22   Escobedo
3  Andrea    Solis    19   Santiago

In [31]:
clase_estadistica['Edad_dias']=clase_estadistica['Edad']*365

In [32]:
clase_estadistica

   Nombre Apellido  Edad  municipio  Edad_dias
0   Jorge    Perez    21  Monterrey       7665
1     Ana     Rosa    26    Apodaca       9490
2    Raúl    Gomez    22   Escobedo       8030
3  Andrea    Solis    19   Santiago       6935

# seleccionar elementos de un dataframe 
1. Seleccion estandar
2. Seleccion .iloc
3. Seleccion .doc
4. Seleccion condicional

In [34]:
## seleccion estandar
# columnas
clase_estadistica['Edad']

0    21
1    26
2    22
3    19
Name: Edad, dtype: int64

In [35]:
clase_estadistica[['Edad','Nombre']]

   Edad  Nombre
0    21   Jorge
1    26     Ana
2    22    Raúl
3    19  Andrea

In [37]:
#seleccion estandar
#rango fila
clase_estadistica[0:2]

  Nombre Apellido  Edad  municipio  Edad_dias
0  Jorge    Perez    21  Monterrey       7665
1    Ana     Rosa    26    Apodaca       9490

In [38]:
clase_estadistica['Nombre'][2:4]

2      Raúl
3    Andrea
Name: Nombre, dtype: object

## Seleccion .iloc(posicion)

DataFrame.iloc[posicion filas, posicion de columnas]

In [41]:
clase_estadistica.iloc[:,3]

0    Monterrey
1      Apodaca
2     Escobedo
3     Santiago
Name: municipio, dtype: object

In [42]:
clase_estadistica.iloc[0]

Nombre           Jorge
Apellido         Perez
Edad                21
municipio    Monterrey
Edad_dias         7665
Name: 0, dtype: object

In [43]:
clase_estadistica.iloc[2:4,[0,2]]

   Nombre  Edad
2    Raúl    22
3  Andrea    19

## seleccion .loc etiquetes
DataFrame.loc[nombre filas,nombres columnas]

In [44]:
clase_estadistica

   Nombre Apellido  Edad  municipio  Edad_dias
0   Jorge    Perez    21  Monterrey       7665
1     Ana     Rosa    26    Apodaca       9490
2    Raúl    Gomez    22   Escobedo       8030
3  Andrea    Solis    19   Santiago       6935

In [49]:
clase_estadistica=clase_estadistica.set_index('municipio')

In [50]:
clase_estadistica.loc[:,'Edad']

municipio
Monterrey    21
Apodaca      26
Escobedo     22
Santiago     19
Name: Edad, dtype: int64

In [54]:
clase_estadistica.loc[['Apodaca','Monterrey']]

          Nombre Apellido  Edad  Edad_dias
municipio
Apodaca      Ana     Rosa    26       9490
Monterrey  Jorge    Perez    21       7665

In [55]:
clase_estadistica.Apellido

municipio
Monterrey    Perez
Apodaca       Rosa
Escobedo     Gomez
Santiago     Solis
Name: Apellido, dtype: object

## seleccion condicional
DataFramse[condiccion]

In [57]:
clase_estadistica[clase_estadistica.Edad>=20]

          Nombre Apellido  Edad  Edad_dias
municipio
Monterrey  Jorge    Perez    21       7665
Apodaca      Ana     Rosa    26       9490
Escobedo    Raúl    Gomez    22       8030

In [58]:
clase_estadistica.query('Edad>=20')

          Nombre Apellido  Edad  Edad_dias
municipio
Monterrey  Jorge    Perez    21       7665
Apodaca      Ana     Rosa    26       9490
Escobedo    Raúl    Gomez    22       8030

In [60]:
clase_estadistica.query('Edad>=20 & Apellido=="Perez"')

          Nombre Apellido  Edad  Edad_dias
municipio
Monterrey  Jorge    Perez    21       7665

In [61]:
clase_estadistica[clase_estadistica.Edad>=20][clase_estadistica['Apellido']=='Perez']

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_11196\3880071776.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  clase_estadistica[clase_estadistica.Edad>=20][clase_estadistica['Apellido']=='Perez']

          Nombre Apellido  Edad  Edad_dias
municipio
Monterrey  Jorge    Perez    21       7665

In [62]:
clase_estadistica

           Nombre Apellido  Edad  Edad_dias
municipio
Monterrey   Jorge    Perez    21       7665
Apodaca       Ana     Rosa    26       9490
Escobedo     Raúl    Gomez    22       8030
Santiago   Andrea    Solis    19       6935

In [63]:
# ordenar menor a mayor

clase_estadistica.sort_values('Edad')

           Nombre Apellido  Edad  Edad_dias
municipio
Santiago   Andrea    Solis    19       6935
Monterrey   Jorge    Perez    21       7665
Escobedo     Raúl    Gomez    22       8030
Apodaca       Ana     Rosa    26       9490

In [64]:
#ordenar mayor a menor
clase_estadistica.sort_values('Edad',ascending=False)

           Nombre Apellido  Edad  Edad_dias
municipio
Apodaca       Ana     Rosa    26       9490
Escobedo     Raúl    Gomez    22       8030
Monterrey   Jorge    Perez    21       7665
Santiago   Andrea    Solis    19       6935

In [65]:
clase_estadistica.sort_values('Apellido')

           Nombre Apellido  Edad  Edad_dias
municipio
Escobedo     Raúl    Gomez    22       8030
Monterrey   Jorge    Perez    21       7665
Apodaca       Ana     Rosa    26       9490
Santiago   Andrea    Solis    19       6935

In [66]:
clase_estadistica.sort_values('Apellido', ascending=False)

           Nombre Apellido  Edad  Edad_dias
municipio
Santiago   Andrea    Solis    19       6935
Apodaca       Ana     Rosa    26       9490
Monterrey   Jorge    Perez    21       7665
Escobedo     Raúl    Gomez    22       8030

podemos usar las funciones de numpy

In [67]:
clase_estadistica['Edad'].mean()

22.0

In [68]:
clase_estadistica['Edad'].sum()

88

In [69]:
clase_estadistica.Edad.sum()

88

In [74]:
clase_estadistica['Edad'].var().round(1)

AttributeError: 'float' object has no attribute 'round'

In [79]:
clase_estadistica['Edad'].var()

8.666666666666666

## np.where(conduccion, valor si cumplio, valor si no se cumple)

In [81]:
# clasificar mayor y menor de edad

import numpy as np

In [82]:
clase_estadistica['matoria_edad']=np.where(clase_estadistica['Edad']>=18,'mayor','menor')

In [83]:
clase_estadistica

           Nombre Apellido  Edad  Edad_dias matoria_edad
municipio
Monterrey   Jorge    Perez    21       7665        mayor
Apodaca       Ana     Rosa    26       9490        mayor
Escobedo     Raúl    Gomez    22       8030        mayor
Santiago   Andrea    Solis    19       6935        mayor

## np.select(condicciones, valor condiccion, valor si cumple, no cumple ninguna condiccion)

In [84]:
##15 - 17 prepa
## 17 - 23 

condicciones=[clase_estadistica['Edad']<=17,clase_estadistica['Edad']<23,clase_estadistica['Edad']>=23]

In [85]:
valores=['Prepa','Universidad','Trabajando']

In [90]:
clase_estadistica['situacion']=clase_estadistica.np.select(condicciones,valores)

AttributeError: 'DataFrame' object has no attribute 'np'

In [91]:
clase_estadistica.groupby('Situacion')['Edad'].mean().round()

KeyError: 'Situacion'

In [94]:
clase_estadistica.groupby('municipio')['Edad'].agg('mean', 'count','std')

municipio
Apodaca      26.0
Escobedo     22.0
Monterrey    21.0
Santiago     19.0
Name: Edad, dtype: float64

In [95]:
clase_estadistica.groupby('municipio')['Edad'].agg('mean', 'count','std')

municipio
Apodaca      26.0
Escobedo     22.0
Monterrey    21.0
Santiago     19.0
Name: Edad, dtype: float64